public class L3S4 {
    public static void main(String args){

    }
}
/*
Задание 1
По пяти значениям функции из таблицы 3.2 пособия (в соответствии с вариантом)
    определить коэффициенты интерполяционного многочлена с помощью решения СЛАУ любым доступным способом.
Написать программу построения графика многочлена по найденным коэффициентам.
    Вывести исходные точки, проверить совпадение.
Добавить в программу построение графика интерполяционного многочлена в форме Лагранжа по заданным точкам.
    Ввода произвольных точек пользователем не требуется. Построение графиков выполнить так, чтобы можно было наблюдать совпадение.
Добавить в программу построение графика интерполяционного многочлена в форме Ньютона по заданным точкам.
    Ввода произвольных точек пользователем не требуется. Построение графиков выполнить так, чтобы можно было наблюдать совпадение.
 */